vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN236_DFP.pdsc
            // config trace clock
            Write32(TRACECLKSEL_Addr, 0x0);   // Select Trace divided clock
            Write32(TRACECLKDIV_Addr, 0x2);   // Select Trace divided clock
          </block>
        </sequence>
        <sequence name="WaitForStopAfterReset">
          <block>
            __var SCS_Addr    = 0xE000E000;
            __var DHCSR_Addr  = SCS_Addr + 0xDF0;
            __var DFSR_Addr  = SCS_Addr + 0xD30;
            DAP_Delay(100000);  // Give bootloader time to do what it needs to do
            Sequence("EnableDebugMailbox");
            Write32(DHCSR_Addr, 0xA05F0003);  // Halt the core in case it didn't stop at a breakpiont.
            // Clear watch point
            Write32(0xE0001020, 0x0);
            Write32(0xE0001028, 0x0);
            Write32(0xE0001030, 0x0);
            Write32(0xE0001038, 0x0);
            Write32(0xE0001040, 0x0);
            Write32(0xE0001048, 0x0);
            Write32(0xE0001050, 0x0);
            Write32(0xE0001058, 0x0);
            
            // Clear XPSR to avoid undefined instruction fault caused by IT/ICI
            Write32(0xE000EDF8, 0x01000000);
            Write32(0xE000EDF4, 0x00010010);
            // Set MSPLIM to 0
            Write32(0xE000EDF8, 0x00000000);
            Write32(0xE000EDF4, 0x0001001C);
          </block>
          <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
          <control while="(Read32(DHCSR_Addr) &amp; 0x02000000)" timeout="500000"/>
          <control if="(Read32(DHCSR_Addr) &amp; 0x00020000) == 0">
            <block>
              Write32(DHCSR_Addr, 0xA05F0003);  // Force halt until finding a proper catch. Probably works better from flash.
            </block>
          </control>
        </sequence>
        <sequence name="ResetHardware">
          <block>
            __var nReset      = 0x80;
            __var canReadPins = 0;
            __var SCS_Addr    = 0xE000E000;
            __var DHCSR_Addr  = SCS_Addr + 0xDF0;
            __var DEMCR_Addr  = SCS_Addr + 0xDFC;
            __var tmp;
            
            //Halt the core
            Write32(DHCSR_Addr, 0xA05F0003);
            //clear VECTOR CATCH and set TRCENA
            tmp = Read32(DEMCR_Addr);
            Write32(DEMCR_Addr, tmp | 0x1000000);
            __errorcontrol = 1;
            
            //// Set watch point at SYSCON_BASE + 0x40 access
            //Write32(0xE0001020, 0x50000040);
            //Write32(0xE0001028, 0x00000814);
            
            // Set watch point
            Write32(0xE0001020, 0x00000000);
            Write32(0xE0001028, 0xF0000412);
            Write32(0xE0001030, 0x000FFFFF);
            Write32(0xE0001038, 0xF0000403);
            
            Write32(0xE0001040, 0x10000000);
            Write32(0xE0001048, 0xF0000412);
            Write32(0xE0001050, 0x100FFFFF);
            Write32(0xE0001058, 0xF0000403);
            
            // De-assert nRESET line
            canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);
          </block>
          <!-- Keep reset active for 50 ms -->
          <control while="1" timeout="50000"/>
          <control if="canReadPins">
            <!-- Assert nRESET line and wait max. 1s for recovery -->
            <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
          </control>
          <control if="!canReadPins">
            <block>
              // Assert nRESET line
              DAP_SWJ_Pins(nReset, nReset, 0);
            </block>
            <!-- Wait 100ms for recovery if nRESET not readable -->
            <control while="1" timeout="100000"/>
          </control>
          <control if="(__connection &amp; (1 &lt;&lt; 17)) == 0">
            <block>
              Sequence("WaitForStopAfterReset");
              __errorcontrol = 0;
            </block>
          </control>
        </sequence>
        <sequence name="ResetSystem">
          <block>
            __dp = 0;
            __ap = 0;
            // System Control Space (SCS) offset as defined in Armv6-M/Armv7-M.
            __var SCS_Addr   = 0xE000E000;
            __var AIRCR_Addr = SCS_Addr + 0xD0C;
            __var DHCSR_Addr = SCS_Addr + 0xDF0;
            __var DEMCR_Addr = SCS_Addr + 0xDFC;
            __var tmp;
            //Halt the core
            Write32(DHCSR_Addr, 0xA05F0003);
            //clear VECTOR CATCH and set TRCENA
            tmp = Read32(DEMCR_Addr);
            Write32(DEMCR_Addr, tmp | 0x1000000);
            
            //// Set watch point at SYSCON_BASE+0x40 access
            //Write32(0xE0001020, 0x50000040);
            //Write32(0xE0001028, 0x00000814);
            
            // Set watch point
            Write32(0xE0001020, 0x00000000);
            Write32(0xE0001028, 0xF0000412);
            Write32(0xE0001030, 0x000FFFFF);
            Write32(0xE0001038, 0xF0000403);
            
            Write32(0xE0001040, 0x10000000);
            Write32(0xE0001048, 0xF0000412);
            Write32(0xE0001050, 0x100FFFFF);
            Write32(0xE0001058, 0xF0000403);
            
            __errorcontrol = 1;
            // Execute SYSRESETREQ via AIRCR
            Write32(AIRCR_Addr, 0x05FA0004);
            Sequence("WaitForStopAfterReset");
            __errorcontrol = 0;
          </block>
        </sequence>
        <sequence name="ResetProcessor" disable="1"/>
        <sequence name="TraceStart">
          <control if="__traceout &amp; 0x1" info="SWO Trace output selected">
            <block>Sequence("EnableTraceClk");       // Enable and configure trace clock</block>
            <control if="SWO_Pin == 0" info="SWO via PIO0_2">
              <block>Write32(0x40116088, 0x00001140); // PIO0_2 PORT0_PCR2 mux to SWO</block>
            </control>
          </control>
        </sequence>
      </sequences>
      <debugvars configfile="devices/MCXN236/arm/MCXN23X.dbgconf">
        // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
        __var SWO_Pin               = 0;                    // Serial Wire Output pin: 0 = PIO0_2
        __var Dbg_CR                = 0x00000000;           // DBG_CR
        __var BootTime              = 300000;                // 300 milliseconds
      </debugvars>
      <description>
        150 MHz Arm® Cortex-M33 TrustZone® microcontroller for Industrial and Consumer IoT Applications.
      </description>
      <device Dname="MCXN236">
        <processor Dcore="Cortex-M33" Dfpu="SP_FPU" Dmpu="MPU" Dtz="TZ" Ddsp="DSP" Dendian="Little-endian" Dclock="150000000"/>
        <environment name="iar">
          <file category="linkerfile" name="devices/MCXN236/iar/MCXN236_flash.icf"/>
        </environment>
        <memory name="BootROM" start="0x03000000" size="0x040000" access="rx"/>
        <memory name="BootROM_alias" start="0x13000000" size="0x040000" access="rx" alias="BootROM"/>
        <memory name="PROGRAM_FLASH0" start="0x00000000" size="0x080000" access="rx" default="1" startup="1"/>
        <memory name="PROGRAM_FLASH1" start="0x00080000" size="0x080000" access="rx" default="1" startup="1"/>
        <memory name="PROGRAM_FLASH_alias0" start="0x10000000" size="0x080000" access="rx" alias="PROGRAM_FLASH0"/>
        <memory name="PROGRAM_FLASH_alias1" start="0x10080000" size="0x080000" access="rx" alias="PROGRAM_FLASH1"/>
        <memory name="SRAM" start="0x20000000" size="0x038000" access="rw" default="1"/>
        <memory name="SRAMX" start="0x04000000" size="0x018000" access="rw" default="1"/>
        <memory name="SRAMX_alias" start="0x14000000" size="0x018000" access="rw" alias="SRAMX"/>
        <memory name="SRAM_alias" start="0x30000000" size="0x038000" access="rw" alias="SRAM"/>
        <algorithm name="devices/MCXN236/arm/MCXN23X_1024.FLM" start="0x0" size="0x100000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
        <algorithm name="devices/MCXN236/arm/MCXN23X_1024_S.FLM" start="0x10000000" size="0x100000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
        <debug svd="devices/MCXN236/MCXN236.xml"/>
        <variant Dvariant="MCXN236VDF">
          <compile header="devices/MCXN236/fsl_device_registers.h" define="CPU_MCXN236VDF"/>
        </variant>
        <variant Dvariant="MCXN236VPB">
          <compile header="devices/MCXN236/fsl_device_registers.h" define="CPU_MCXN236VPB"/>
        </variant>
        <variant Dvariant="MCXN236VNL">
          <compile header="devices/MCXN236/fsl_device_registers.h" define="CPU_MCXN236VNL"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device.MCXN236.internal_condition">
      <accept Dname="MCXN236VDF" Dvendor="NXP:11"/>
      <accept Dname="MCXN236VKL" Dvendor="NXP:11"/>
      <accept Dname="MCXN236VNL" Dvendor="NXP:11"/>
      <accept Dname="MCXN236VPB" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=MCXN236.internal_condition"/>
    </condition>
    <condition id="allOf.device=MCXN236.internal_condition">
      <require condition="device.MCXN236.internal_condition"/>
    </condition>
    <condition id="component.ak4497_adapter.condition_id">
      <require condition="allOf.device=MCXN236.internal_condition"/>
    </condition>
    <condition id="component.at_least_one_i2c_mux_device_enabled.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MCXN236.internal_condition"/>
    </condition>
