vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN236_DFP.pdsc
    <condition id="allOf.component.els_pkc.mac, device=MCXN236.internal_condition">
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_mac"/>
      <require condition="device.MCXN236.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.math.condition_id">
      <require condition="allOf.component.els_pkc.buffer, component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MCXN236.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.memory.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.param_integrity, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MCXN236.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.param_integrity, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MCXN236.internal_condition">
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_param_integrity"/>
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_toolchain"/>
      <require condition="device.MCXN236.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca.condition_id">
      <require condition="allOf.component.els_pkc.crc, component.els_pkc.oscca_aeadmodes, component.els_pkc.oscca_ciphermodes, component.els_pkc.oscca_macmodes, component.els_pkc.oscca_pkc, component.els_pkc.oscca_randommodes, component.els_pkc.oscca_safo, component.els_pkc.oscca_sm2, component.els_pkc.oscca_sm3, component.els_pkc.oscca_sm4, component.els_pkc.signature, device=MCXN236.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.crc, component.els_pkc.oscca_aeadmodes, component.els_pkc.oscca_ciphermodes, component.els_pkc.oscca_macmodes, component.els_pkc.oscca_pkc, component.els_pkc.oscca_randommodes, component.els_pkc.oscca_safo, component.els_pkc.oscca_sm2, component.els_pkc.oscca_sm3, component.els_pkc.oscca_sm4, component.els_pkc.signature, device=MCXN236.internal_condition">
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_crc"/>
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_oscca_aeadmodes"/>
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_oscca_ciphermodes"/>
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_oscca_macmodes"/>
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_oscca_pkc"/>
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_oscca_randommodes"/>
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_oscca_safo"/>
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_oscca_sm2"/>
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_oscca_sm3"/>
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_oscca_sm4"/>
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_signature"/>
      <require condition="device.MCXN236.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_aeadmodes.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MCXN236.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.common, device=MCXN236.internal_condition">
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_common"/>
      <require condition="device.MCXN236.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_ciphermodes.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MCXN236.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_macmodes.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MCXN236.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_pkc.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MCXN236.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_randommodes.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MCXN236.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_safo.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MCXN236.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_sm2.condition_id">
      <require condition="allOf.component.els_pkc.common, component.els_pkc.signature, device=MCXN236.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.common, component.els_pkc.signature, device=MCXN236.internal_condition">
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_common"/>
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_signature"/>
      <require condition="device.MCXN236.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_sm3.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MCXN236.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_sm4.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MCXN236.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.padding.condition_id">
      <require condition="allOf.component.els_pkc.buffer, device=MCXN236.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.param_integrity.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MCXN236.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MCXN236.internal_condition">
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MCXN236 els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require condition="device.MCXN236.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.pkc.condition_id">
      <require condition="allOf.component.els_pkc.ecc, component.els_pkc.math, component.els_pkc.rsa, device=MCXN236.internal_condition"/>
    </condition>
