vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN236_DFP.pdsc
    <component Cclass="MCXN236 els_pkc" Cgroup="els_pkc_examples_els" Cversion="1.9.0" condition="component.els_pkc.examples_els.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Cipher_Aes128_Cbc_Encrypt_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Cipher_Aes128_Ecb_Encrypt_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Common_Get_Info_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Ecc_Keygen_Sign_Verify_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Hash_HW_Security_Counter_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Hash_Sha224_One_Block_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Hash_Sha256_One_Block_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Hash_Sha384_One_Block_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Hash_Sha512_One_Block_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Rng_Prng_Get_Random_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Tls_Master_Key_Session_Keys_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRandomModes/mcuxClRandomModes_ELS_example.c" projectpath="component/els_pkc/examples/mcuxClRandomModes"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClExample/inc/mcuxClExample_ELS_Helper.h" projectpath="component/els_pkc/src/comps/mcuxClExample/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClExample/inc/mcuxClExample_ELS_Key_Helper.h" projectpath="component/els_pkc/src/comps/mcuxClExample/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClExample/inc/mcuxClExample_Key_Helper.h" projectpath="component/els_pkc/src/comps/mcuxClExample/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClExample/inc/mcuxClExample_RFC3394_Helper.h" projectpath="component/els_pkc/src/comps/mcuxClExample/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClExample/inc/mcuxClExample_RNG_Helper.h" projectpath="component/els_pkc/src/comps/mcuxClExample/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClExample/inc/mcuxClExample_Session_Helper.h" projectpath="component/els_pkc/src/comps/mcuxClExample/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN236 els_pkc" Cgroup="els_pkc_examples_flow_protection" Cversion="1.9.0" condition="component.els_pkc.examples_flow_protection.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxCsslFlowProtection/mcuxCsslFlowProtection_example.c" projectpath="component/els_pkc/examples/mcuxCsslFlowProtection"/>
        <file category="header" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/mcuxCsslExamples.h" projectpath="component/els_pkc/examples/mcuxCsslFlowProtection/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN236 els_pkc" Cgroup="els_pkc_examples_hash_modes" Cversion="1.9.0" condition="component.els_pkc.examples_hash_modes.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClHashModes/mcuxClHashModes_sha1_longMsgOneshot_example.c" projectpath="component/els_pkc/examples/mcuxClHashModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClHashModes/mcuxClHashModes_sha1_oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClHashModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClHashModes/mcuxClHashModes_sha1_streaming_example.c" projectpath="component/els_pkc/examples/mcuxClHashModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClHashModes/mcuxClHashModes_sha224_oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClHashModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClHashModes/mcuxClHashModes_sha256_longMsgOneshot_example.c" projectpath="component/els_pkc/examples/mcuxClHashModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClHashModes/mcuxClHashModes_sha256_oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClHashModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClHashModes/mcuxClHashModes_sha256_streaming_example.c" projectpath="component/els_pkc/examples/mcuxClHashModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClHashModes/mcuxClHashModes_sha384_oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClHashModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClHashModes/mcuxClHashModes_sha512_224_oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClHashModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClHashModes/mcuxClHashModes_sha512_256_oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClHashModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClHashModes/mcuxClHashModes_sha512_256_streaming_example.c" projectpath="component/els_pkc/examples/mcuxClHashModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClHashModes/mcuxClHashModes_sha512_oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClHashModes"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
