vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN236_DFP.pdsc
    <component Cclass="MCXN236 els_pkc" Cgroup="els_pkc_pkc" Cversion="1.9.0" condition="component.els_pkc.pkc.condition_id">
      <description>Component pkc</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPkc/src/mcuxClPkc_Calculate.c" projectpath="component/els_pkc/src/comps/mcuxClPkc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPkc/src/mcuxClPkc_ImportExport.c" projectpath="component/els_pkc/src/comps/mcuxClPkc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPkc/src/mcuxClPkc_Initialize.c" projectpath="component/els_pkc/src/comps/mcuxClPkc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPkc/src/mcuxClPkc_UPTRT.c" projectpath="component/els_pkc/src/comps/mcuxClPkc/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/mcuxClPkc.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/mcuxClPkc_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/mcuxClPkc_Types.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_FupMacros.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_ImportExport.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Inline_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Macros.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Operations.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Resource.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_SfrAccess.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPkc/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN236 els_pkc" Cgroup="els_pkc_platform" Cversion="1.9.0" condition="component.els_pkc.platform.mcxn.condition_id">
      <description>Component els_pkc_mcxn</description>
      <files>
        <file category="header" name="components/els_pkc/src/platforms/mcxn/platform_specific_headers.h" projectpath="component/els_pkc/src/platforms/mcxn"/>
        <file category="header" name="components/els_pkc/src/platforms/mcxn/mcuxClConfig.h" projectpath="component/els_pkc/src/platforms/mcxn"/>
        <file category="sourceC" name="components/els_pkc/src/platforms/mcxn/mcux_els.c" projectpath="component/els_pkc/src/platforms/mcxn"/>
        <file category="header" name="components/els_pkc/src/platforms/mcxn/mcux_els.h" projectpath="component/els_pkc/src/platforms/mcxn"/>
        <file category="sourceC" name="components/els_pkc/src/platforms/mcxn/mcux_pkc.c" projectpath="component/els_pkc/src/platforms/mcxn"/>
        <file category="header" name="components/els_pkc/src/platforms/mcxn/mcux_pkc.h" projectpath="component/els_pkc/src/platforms/mcxn"/>
        <file category="header" name="components/els_pkc/src/platforms/mcxn/inc/ip_css_constants.h" projectpath="component/els_pkc/src/platforms/mcxn/inc"/>
        <file category="header" name="components/els_pkc/src/platforms/mcxn/inc/ip_css_design_configuration.h" projectpath="component/els_pkc/src/platforms/mcxn/inc"/>
        <file category="header" name="components/els_pkc/src/platforms/mcxn/inc/ip_platform.h" projectpath="component/els_pkc/src/platforms/mcxn/inc"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClAeadModes_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClCipherModes_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClEcc_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClHashModes_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClHash_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClHmac_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClKey_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClMacModes_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClOsccaSm3_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClRandomModes_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClRsa_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="header" name="components/els_pkc/includes/platform/mcxn/mcuxClSession_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mcxn"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/platforms/mcxn/"/>
        <file category="include" name="components/els_pkc/src/platforms/mcxn/inc/"/>
        <file category="include" name="components/els_pkc/includes/platform/mcxn/"/>
      </files>
    </component>
    <component Cclass="MCXN236 els_pkc" Cgroup="els_pkc_pre_processor" Cversion="1.9.0" condition="component.els_pkc.pre_processor.condition_id">
      <description>Component els_pkc.pre_processor</description>
      <files>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslCPreProcessor/inc/mcuxCsslAnalysis.h" projectpath="component/els_pkc/src/comps/mcuxCsslCPreProcessor/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslCPreProcessor/inc/mcuxCsslCPreProcessor.h" projectpath="component/els_pkc/src/comps/mcuxCsslCPreProcessor/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxCsslCPreProcessor/inc/"/>
      </files>
    </component>
