vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN236_DFP.pdsc
    <component Cclass="MCXN236 els_pkc" Cgroup="els_pkc_rsa_oaep" Cversion="1.9.0" condition="component.els_pkc.rsa_oaep.condition_id">
      <description>Component els_pkc.rsa_oaep</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_KeyTypes.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_ModeConstructors.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_OaepDecode.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_OaepEncode.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_pkcs1v15Decode_decrypt.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Pkcs1v15Encode_encrypt.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Util_Decrypt.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Util_Encrypt.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_KeyTypes.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_ModeConstructors.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRsa/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN236 els_pkc" Cgroup="els_pkc_secure_counter" Cversion="1.9.0" condition="component.els_pkc.secure_counter.condition_id">
      <description>Component els_pkc.secure_counter</description>
      <files>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslSecureCounter/inc/mcuxCsslSecureCounter.h" projectpath="component/els_pkc/src/comps/mcuxCsslSecureCounter/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslSecureCounter/inc/mcuxCsslSecureCounter_Cfg.h" projectpath="component/els_pkc/src/comps/mcuxCsslSecureCounter/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslSecureCounter/inc/mcuxCsslSecureCounter_Impl.h" projectpath="component/els_pkc/src/comps/mcuxCsslSecureCounter/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslSecureCounter/inc/mcuxCsslSecureCounter_None.h" projectpath="component/els_pkc/src/comps/mcuxCsslSecureCounter/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslSecureCounter/inc/mcuxCsslSecureCounter_SW_Local.h" projectpath="component/els_pkc/src/comps/mcuxCsslSecureCounter/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxCsslSecureCounter/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN236 els_pkc" Cgroup="els_pkc_session" Cversion="1.9.0" condition="component.els_pkc.session.condition_id">
      <description>Component els_pkc.session</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClSession/src/mcuxClSession.c" projectpath="component/els_pkc/src/comps/mcuxClSession/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSession/inc/mcuxClSession.h" projectpath="component/els_pkc/src/comps/mcuxClSession/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSession/inc/mcuxClSession_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClSession/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSession/inc/mcuxClSession_Types.h" projectpath="component/els_pkc/src/comps/mcuxClSession/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_EntryExit.h" projectpath="component/els_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_EntryExit_RegularReturn.h" projectpath="component/els_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClSession/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClSession/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN236 els_pkc" Cgroup="els_pkc_signature" Cversion="1.9.0" condition="component.els_pkc.signature.condition_id">
      <description>Component els_pkc.signature</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClSignature/src/mcuxClSignature.c" projectpath="component/els_pkc/src/comps/mcuxClSignature/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSignature/inc/mcuxClSignature.h" projectpath="component/els_pkc/src/comps/mcuxClSignature/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSignature/inc/mcuxClSignature_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClSignature/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSignature/inc/mcuxClSignature_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClSignature/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSignature/inc/mcuxClSignature_Types.h" projectpath="component/els_pkc/src/comps/mcuxClSignature/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSignature/inc/internal/mcuxClSignature_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClSignature/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClSignature/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClSignature/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN236 els_pkc" Cgroup="els_pkc_standalone_gdetr" Cversion="1.9.0" condition="component.els_pkc.standalone_gdet.condition_id">
      <description>Component els_pkc standalone_gdet</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEls/src/mcuxClEls_GlitchDetector.c" projectpath="component/els_pkc/src/comps/mcuxClEls/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEls/inc/mcuxClEls_GlitchDetector.h" projectpath="component/els_pkc/src/comps/mcuxClEls/inc"/>
        <file category="header" name="components/els_pkc/includes/mcuxClEls_GlitchDetector.h" projectpath="component/els_pkc/includes" path="components/els_pkc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClEls/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN236 els_pkc" Cgroup="static_lib_mcxn" Csub="mcxn" Cversion="1.9.0" condition="component.els_pkc.static_lib.mcxn.condition_id">
      <description>Component els_pkc static_lib MCXN</description>
      <files>
        <file category="library" name="components/els_pkc/static_library/mcxn/libclns.a" projectpath="component/els_pkc/static_library/mcxn"/>
        <file category="other" name="components/els_pkc/static_library/mcxn/libclns.a.libsize" projectpath="component/els_pkc/static_library/mcxn"/>
        <file category="other" name="components/els_pkc/static_library/mcxn/libclns.a.objsize" projectpath="component/els_pkc/static_library/mcxn"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
