vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN236_DFP.pdsc
    <component Cclass="MCXN236 els_pkc" Cgroup="els_pkc_toolchain" Cversion="1.9.0" condition="component.els_pkc.toolchain.condition_id">
      <description>Component els_pkc toolchain</description>
      <files>
        <file category="header" name="components/els_pkc/src/compiler/mcuxClToolchain.h" projectpath="component/els_pkc/src/compiler"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/compiler/"/>
      </files>
    </component>
    <component Cclass="MCXN236 els_pkc" Cgroup="els_pkc_trng" Cversion="1.9.0" condition="component.els_pkc.trng.condition_id">
      <description>Component els_pkc.trng</description>
      <files>
        <file category="header" name="components/els_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClTrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClTrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClTrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal_SA_TRNG.h" projectpath="component/els_pkc/src/comps/mcuxClTrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal_Types.h" projectpath="component/els_pkc/src/comps/mcuxClTrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_SfrAccess.h" projectpath="component/els_pkc/src/comps/mcuxClTrng/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClTrng/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClTrng/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN236 els_pkc" Cgroup="els_pkc_trng_type_els" Cversion="1.9.0" condition="component.els_pkc.trng.type_els.condition_id">
      <description>Component els_pkc.trng.type_els</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_NormalMode.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClTrng/src/mcuxClTrng_ELS.c" projectpath="component/els_pkc/src/comps/mcuxClTrng/src"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="MCXN236 els_pkc" Cgroup="els_pkc_trng_type_rng4" Cversion="1.9.0" condition="component.els_pkc.trng.type_rng4.condition_id">
      <description>Component els_pkc.trng.type_rng4</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClTrng/src/mcuxClTrng_SA_TRNG.c" projectpath="component/els_pkc/src/comps/mcuxClTrng/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_SfrAccess.h" projectpath="component/els_pkc/src/comps/mcuxClTrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal_SA_TRNG.h" projectpath="component/els_pkc/src/comps/mcuxClTrng/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClTrng/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClTrng/inc/internal/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="enable_pca9544" Cversion="1.0.0" condition="component.enable_pca9544.condition_id">
      <description>Component enable_pca9544</description>
      <RTE_Components_h>
#ifndef MCUX_ENABLE_PCA9544
#define MCUX_ENABLE_PCA9544 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="components/i2c/muxes/component.enable_pca9544_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="enable_pca9548" Cversion="1.0.0" condition="component.enable_pca9548.condition_id">
      <description>Component enable_pca9548</description>
      <RTE_Components_h>
#ifndef MCUX_ENABLE_PCA9548
#define MCUX_ENABLE_PCA9548 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="components/i2c/muxes/component.enable_pca9548_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-common" Cversion="2.0.0" condition="component.eth_phy_common.condition_id">
      <description>Driver phy-common</description>
      <files>
        <file category="header" name="components/phy/fsl_phy.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flash_adapter" Cversion="1.0.0" condition="component.flash_adapter.condition_id">
      <description>Component flash_adapter</description>
      <files>
        <file category="doc" name="components/internal_flash/component.flash_adapter_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gpio_adapter" Cversion="1.0.1" condition="component.gpio_adapter.condition_id">
      <description>Component gpio_adapter</description>
      <files>
        <file category="header" name="components/gpio/fsl_adapter_gpio.h" projectpath="component/gpio"/>
        <file category="sourceC" name="components/gpio/fsl_adapter_gpio.c" projectpath="component/gpio"/>
        <file category="include" name="components/gpio/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface" Cversion="1.0.0" condition="component.i2c_adapter_interface.condition_id">
      <description>Component i2c_adapter_interface</description>
      <files>
        <file category="header" name="components/i2c/fsl_adapter_i2c.h" projectpath="component/i2c"/>
        <file category="include" name="components/i2c/"/>
      </files>
    </component>
