vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN236_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_legacy" Cversion="1.0.0" condition="component.mem_manager_legacy.condition_id">
      <description>Component mem_manager_legacy</description>
      <files>
        <file category="sourceC" name="components/mem_manager/fsl_component_mem_manager.c" projectpath="component/mem_manager"/>
        <file category="include" name="components/mem_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_light" Cversion="1.0.0" condition="component.mem_manager_light.condition_id">
      <description>Component mem_manager_light</description>
      <files>
        <file category="sourceC" name="components/mem_manager/fsl_component_mem_manager_light.c" projectpath="component/mem_manager"/>
        <file category="include" name="components/mem_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_offchip" Cversion="1.0.0" condition="component.mflash_offchip.condition_id">
      <description>mflash offchip</description>
      <RTE_Components_h>
        #ifndef MFLASH_FILE_BASEADDR
        #define MFLASH_FILE_BASEADDR 134217728
        #endif
        #ifndef MFLASH_OFF_CHIP
        #define MFLASH_OFF_CHIP 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/flash/mflash/mflash_common.h" projectpath="flash/mflash"/>
        <file category="sourceC" name="components/flash/mflash/mflash_file.c" projectpath="flash/mflash"/>
        <file category="header" name="components/flash/mflash/mflash_file.h" projectpath="flash/mflash"/>
        <file category="sourceC" name="components/flash/mflash/mcxnx4x_flexspi/mflash_drv.c" projectpath="flash/mflash/mcxnx4x_flexspi"/>
        <file category="header" name="components/flash/mflash/mcxnx4x_flexspi/mflash_drv.h" projectpath="flash/mflash/mcxnx4x_flexspi"/>
        <file category="include" name="components/flash/mflash/"/>
        <file category="include" name="components/flash/mflash/mcxnx4x_flexspi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_onchip" Cversion="1.0.0" condition="component.mflash_onchip.condition_id">
      <description>mflash onchip</description>
      <RTE_Components_h>
        #ifndef MFLASH_FILE_BASEADDR
        #define MFLASH_FILE_BASEADDR 131072
        #endif
        #ifndef MFLASH_ON_CHIP
        #define MFLASH_ON_CHIP 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/flash/mflash/mflash_common.h" projectpath="flash/mflash"/>
        <file category="sourceC" name="components/flash/mflash/mflash_file.c" projectpath="flash/mflash"/>
        <file category="header" name="components/flash/mflash/mflash_file.h" projectpath="flash/mflash"/>
        <file category="sourceC" name="components/flash/mflash/mcxnx4x/mflash_drv.c" projectpath="flash/mflash/mcxnx4x"/>
        <file category="header" name="components/flash/mflash/mcxnx4x/mflash_drv.h" projectpath="flash/mflash/mcxnx4x"/>
        <file category="include" name="components/flash/mflash/"/>
        <file category="include" name="components/flash/mflash/mcxnx4x/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_onchip_fmu" Cversion="1.0.0" condition="component.mflash_onchip_fmu.condition_id">
      <description>mflash onchip_fmu</description>
      <RTE_Components_h>
        #ifndef MFLASH_FILE_BASEADDR
        #define MFLASH_FILE_BASEADDR 131072
        #endif
        #ifndef MFLASH_ON_CHIP
        #define MFLASH_ON_CHIP 1
        #endif
        #ifndef MFLASH_ON_CHIP_USE_FMU
        #define MFLASH_ON_CHIP_USE_FMU 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/flash/mflash/mflash_common.h" projectpath="flash/mflash"/>
        <file category="sourceC" name="components/flash/mflash/mflash_file.c" projectpath="flash/mflash"/>
        <file category="header" name="components/flash/mflash/mflash_file.h" projectpath="flash/mflash"/>
        <file category="sourceC" name="components/flash/mflash/mcxnx4x_fmu/mflash_drv.c" projectpath="flash/mflash/mcxnx4x_fmu"/>
        <file category="header" name="components/flash/mflash/mcxnx4x_fmu/mflash_drv.h" projectpath="flash/mflash/mcxnx4x_fmu"/>
        <file category="include" name="components/flash/mflash/"/>
        <file category="include" name="components/flash/mflash/mcxnx4x_fmu/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mrt_adapter" Cversion="1.0.0" condition="component.mrt_adapter.condition_id">
      <description>Component mrt_adapter</description>
      <RTE_Components_h>
#ifndef TIMER_PORT_TYPE_MRT
#define TIMER_PORT_TYPE_MRT 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/timer/fsl_adapter_timer.h" projectpath="component/timer"/>
        <file category="sourceC" name="components/timer/fsl_adapter_mrt.c" projectpath="component/timer"/>
        <file category="include" name="components/timer/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer_adapter" Cversion="1.0.0" condition="component.ostimer_adapter.condition_id">
      <description>Component ostimer_adapter</description>
      <RTE_Components_h>
#ifndef TIMER_PORT_TYPE_OSTIMER
#define TIMER_PORT_TYPE_OSTIMER 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/timer/fsl_adapter_timer.h" projectpath="component/timer"/>
        <file category="sourceC" name="components/timer/fsl_adapter_ostimer.c" projectpath="component/timer"/>
        <file category="include" name="components/timer/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="panic" Cversion="1.0.0" condition="component.panic.condition_id">
      <description>Component panic</description>
      <files>
        <file category="header" name="components/panic/fsl_component_panic.h" projectpath="component/panic"/>
        <file category="sourceC" name="components/panic/fsl_component_panic.c" projectpath="component/panic"/>
        <file category="include" name="components/panic/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pcm186x_adapter" Cversion="2.0.0" condition="component.pcm186x_adapter.condition_id">
      <description>Component pcm186x adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/pcm186x/fsl_codec_pcm186x_adapter.h" projectpath="codec/port/pcm186x"/>
        <file category="sourceC" name="components/codec/port/pcm186x/fsl_codec_pcm186x_adapter.c" projectpath="codec/port/pcm186x"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/pcm186x/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pcm512x_adapter" Cversion="2.0.0" condition="component.pcm512x_adapter.condition_id">
      <description>Component pcm512x adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/pcm512x/fsl_codec_pcm512x_adapter.h" projectpath="codec/port/pcm512x"/>
        <file category="sourceC" name="components/codec/port/pcm512x/fsl_codec_pcm512x_adapter.c" projectpath="codec/port/pcm512x"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/pcm512x/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-aqr113c" Cversion="2.0.0" condition="component.phyaqr113c.condition_id">
      <description>Driver phy-device-aqr113c</description>
      <files>
        <file category="sourceC" name="components/phy/device/phyaqr113c/fsl_phyaqr113c.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phyaqr113c/fsl_phyaqr113c.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phyaqr113c/"/>
      </files>
    </component>
