vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN236_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-ar8031" Cversion="2.0.0" condition="component.phyar8031.condition_id">
      <description>Driver phy-device-ar8031</description>
      <files>
        <file category="sourceC" name="components/phy/device/phyar8031/fsl_phyar8031.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phyar8031/fsl_phyar8031.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phyar8031/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-dp8384x" Cversion="2.0.0" condition="component.phydp8384x.condition_id">
      <description>Driver phy-device-dp8384x</description>
      <files>
        <file category="sourceC" name="components/phy/device/phydp8384x/fsl_phydp8384x.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phydp8384x/fsl_phydp8384x.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phydp8384x/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-gpy215" Cversion="2.0.0" condition="component.phygpy215.condition_id">
      <description>Driver phy-device-gpy215</description>
      <files>
        <file category="sourceC" name="components/phy/device/phygpy215/fsl_phygpy215.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phygpy215/fsl_phygpy215.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phygpy215/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-ksz8041" Cversion="2.0.0" condition="component.phyksz8041.condition_id">
      <description>Driver phy-device-ksz8041</description>
      <files>
        <file category="sourceC" name="components/phy/device/phyksz8041/fsl_phyksz8041.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phyksz8041/fsl_phyksz8041.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phyksz8041/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-ksz8081" Cversion="2.0.0" condition="component.phyksz8081.condition_id">
      <description>Driver phy-device-ksz8081</description>
      <files>
        <file category="sourceC" name="components/phy/device/phyksz8081/fsl_phyksz8081.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phyksz8081/fsl_phyksz8081.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phyksz8081/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-lan8720a" Cversion="2.0.0" condition="component.phylan8720a.condition_id">
      <description>Driver phy-device-lan8720a</description>
      <files>
        <file category="sourceC" name="components/phy/device/phylan8720a/fsl_phylan8720a.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phylan8720a/fsl_phylan8720a.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phylan8720a/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-lan8741" Cversion="2.0.0" condition="component.phylan8741.condition_id">
      <description>Driver phy-device-lan8741</description>
      <files>
        <file category="sourceC" name="components/phy/device/phylan8741/fsl_phylan8741.c" projectpath="phy"/>
        <file category="header" name="components/phy/device/phylan8741/fsl_phylan8741.h" projectpath="phy"/>
        <file category="include" name="components/phy/device/phylan8741/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-rtl8201" Cversion="2.0.0" condition="component.phyrtl8201.condition_id">
      <description>Driver phy-device-rtl8201</description>
      <files>
        <file category="sourceC" name="components/phy/device/phyrtl8201/fsl_phyrtl8201.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phyrtl8201/fsl_phyrtl8201.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phyrtl8201/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-rtl8211f" Cversion="2.0.0" condition="component.phyrtl8211f.condition_id">
      <description>Driver phy-device-rtl8211f</description>
      <files>
        <file category="sourceC" name="components/phy/device/phyrtl8211f/fsl_phyrtl8211f.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phyrtl8211f/fsl_phyrtl8211f.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phyrtl8211f/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-tja1100" Cversion="2.0.0" condition="component.phytja1100.condition_id">
      <description>Driver phy-device-tja1100</description>
      <files>
        <file category="sourceC" name="components/phy/device/phytja1100/fsl_phytja1100.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phytja1100/fsl_phytja1100.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phytja1100/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-tja1120" Cversion="2.0.0" condition="component.phytja1120.condition_id">
      <description>Driver phy-device-tja1120</description>
      <files>
        <file category="sourceC" name="components/phy/device/phytja1120/fsl_phytja1120.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phytja1120/fsl_phytja1120.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phytja1120/"/>
      </files>
    </component>
